TienHuyIoT/ESP32Async-AsyncTCP/src/AsyncTCP.cpp
void AsyncTCP_detail::handle_async_event(lwip_tcp_event_packet_t *e) {
  if (e->client == NULL) {
    if (e->event == LWIP_TCP_CALLBACK) {
      e->callback.fn(e->callback.arg);
    }
    return;
  }

  if (e->event == LWIP_TCP_RECV) {
    // ets_printf("-R: 0x%08x\n", e->recv.pcb);
    e->client->_recv(e->recv.pcb, e->recv.pb, e->recv.err);
    e->recv.pb = nullptr;  // avoid _free_event() shall call pbuf_free() again due to _recv() called pbuf_free() inside.
  } else if (e->event == LWIP_TCP_FIN) {
    // ets_printf("-F: 0x%08x\n", e->fin.pcb);
    e->client->_fin(e->fin.pcb, e->fin.err);
  } else if (e->event == LWIP_TCP_DISCONNECT) {
    // ets_printf("-F: 0x%08x\n", e->fin.pcb);
    e->client->_disconnect(e->disconnect.err);
  } else if (e->event == LWIP_TCP_SENT) {
    // ets_printf("-S: 0x%08x\n", e->sent.pcb);
    e->client->_sent(e->sent.pcb, e->sent.len);
  } else if (e->event == LWIP_TCP_POLL) {
    // ets_printf("-P: 0x%08x\n", e->poll.pcb);
    e->client->_poll(e->poll.pcb);
  } else if (e->event == LWIP_TCP_ERROR) {
    // ets_printf("-E: 0x%08x %d\n", e->client, e->error.err);
    e->client->_error(e->error.err);
  } else if (e->event == LWIP_TCP_CONNECTED) {
    // ets_printf("C: 0x%08x 0x%08x %d\n", e->client, e->connected.pcb, e->connected.err);
    e->client->_connected(e->connected.pcb);
  } else if (e->event == LWIP_TCP_ACCEPT) {
    // ets_printf("A: 0x%08x 0x%08x\n", e->client, e->accept.client);
    e->accept.server->_accepted(e->client);
  } else if (e->event == LWIP_TCP_DNS) {
    // ets_printf("D: 0x%08x %s = %s\n", e->client, e->dns.name, ipaddr_ntoa(&e->dns.addr));
    e->client->_dns_found(&e->dns.addr);
  }
}

/**
 * AsyncTCP thread
*/
static void _async_service_task(void *pvParameters) {
#if CONFIG_ASYNC_TCP_USE_WDT
  if (esp_task_wdt_add(NULL) != ESP_OK) {
    log_w("Failed to add async task to WDT");
  }
#endif
  for (;;) {
    while (auto packet = _get_async_event()) {
      AsyncTCP_detail::handle_async_event(packet);
      _free_event(packet);
#if CONFIG_ASYNC_TCP_USE_WDT
      esp_task_wdt_reset();
#endif
    }
    // queue is empty
    // DEBUG_PRINTF("Async task waiting 0x%08",(intptr_t)_async_queue_head);
    ulTaskNotifyTake(pdTRUE, ASYNC_TCP_MAX_TASK_SLEEP);
    // DEBUG_PRINTF("Async task woke = %d 0x%08x",q, (intptr_t)_async_queue_head);
#if CONFIG_ASYNC_TCP_USE_WDT
    esp_task_wdt_reset();
#endif
  }
#if CONFIG_ASYNC_TCP_USE_WDT
  esp_task_wdt_delete(NULL);
#endif
  vTaskDelete(NULL);
  _async_service_task_handle = NULL;
}

/*
static void _stop_async_task(){
    if(_async_service_task_handle){
        vTaskDelete(_async_service_task_handle);
        _async_service_task_handle = NULL;
    }
}
*/

static bool customTaskCreateUniversal(
  TaskFunction_t pxTaskCode, const char *const pcName, const uint32_t usStackDepth, void *const pvParameters, UBaseType_t uxPriority,
  TaskHandle_t *const pxCreatedTask, const BaseType_t xCoreID
) {
#ifndef CONFIG_FREERTOS_UNICORE
  if (xCoreID >= 0 && xCoreID < 2) {
    return xTaskCreatePinnedToCore(pxTaskCode, pcName, usStackDepth, pvParameters, uxPriority, pxCreatedTask, xCoreID);
  } else {
#endif
    return xTaskCreate(pxTaskCode, pcName, usStackDepth, pvParameters, uxPriority, pxCreatedTask);
#ifndef CONFIG_FREERTOS_UNICORE
  }
#endif
}

static bool _start_async_task() {
  if (!_async_queue_mutex) {
    _async_queue_mutex = xSemaphoreCreateMutex();
    if (!_async_queue_mutex) {
      return false;
    }
  }

  if (!_client_slot_mutex) {
    _client_slot_mutex = xSemaphoreCreateMutex();
    if (!_client_slot_mutex) {
      return false;
    }
  }

  if (!_async_service_task_handle) {
    customTaskCreateUniversal(
      _async_service_task, "async_tcp", CONFIG_ASYNC_TCP_STACK_SIZE, NULL, CONFIG_ASYNC_TCP_PRIORITY, &_async_service_task_handle, CONFIG_ASYNC_TCP_RUNNING_CORE
    );
    if (!_async_service_task_handle) {
      return false;
    }
  }
  return true;
}

/*
 * LwIP Callbacks
 * */

// For safe: only run in LwIP callbacks or TPC/IP raw API tcpip_api_call and tcpip_callback
static void _bind_tcp_callbacks(tcp_pcb *pcb, AsyncClient *client) {
  tcp_arg(pcb, client);
  tcp_recv(pcb, &AsyncTCP_detail::tcp_recv);
  tcp_sent(pcb, &AsyncTCP_detail::tcp_sent);
  tcp_err(pcb, &AsyncTCP_detail::tcp_error);
  tcp_poll(pcb, &AsyncTCP_detail::tcp_poll, CONFIG_ASYNC_TCP_POLL_TIMER);
}

// For safe: only run in LwIP callbacks or TPC/IP raw API tcpip_api_call and tcpip_callback
static void _reset_tcp_callbacks(tcp_pcb *pcb, AsyncClient *client) {
  tcp_arg(pcb, NULL);
  tcp_sent(pcb, NULL);
  tcp_recv(pcb, NULL);
  tcp_err(pcb, NULL);
  tcp_poll(pcb, NULL, 0);
}

// TCP Server: listen pcb callback
err_t AsyncTCP_detail::tcp_accept(void *arg, tcp_pcb *c_pcb, err_t err) {
  AsyncServer *s = reinterpret_cast<AsyncServer *>(arg);
  AsyncClient *c = (ERR_OK == err && c_pcb && s) ? new (std::nothrow) AsyncClient(c_pcb, s) : nullptr;
  lwip_tcp_event_packet_t *e = (c) ? new (std::nothrow) lwip_tcp_event_packet_t{LWIP_TCP_ACCEPT, c} : nullptr;
  s8_t slot = (e) ? _register_client_slot(c) : INVALID_CLIENT_SLOT;
  bool accepted = (slot != INVALID_CLIENT_SLOT && s->_listen_connect_cb) ? true : false;
  
  ASYNC_TCP_CONSOLE_I("New pcb: %u, err = %d, client %u", c_pcb, err, c);
  if (!accepted) {
    ASYNC_TCP_CONSOLE_E("Accept failed: %d", err);

    if (e) {
      delete e;
    }
    
    if (c) {
      delete c;
    }
    
    if (slot != INVALID_CLIENT_SLOT) {
      _unregister_client_slot(c);
    }

    // Check if c_pcb was allocated
    if (c_pcb) {
      tcp_abort(c_pcb);
      // https://github.com/espressif/esp-lwip/blob/master/src/core/tcp.c#L636
      return ERR_ABRT;  // correct after aborting
    }
    return ERR_MEM;  // Didn't abort anything, just report resource issue
  }
  
  queue_mutex_guard guard;
  c->_pcb = c_pcb;
  c->_slot = slot;  // now slot is valid
  e->client = c;
  e->accept.server = s;
  _bind_tcp_callbacks(c_pcb, c);
  _prepend_async_event(e);
  return ERR_OK;
}

/**
 * TCP Client: connection callback
 * Do not need to call tcp_abort(pcb).
 * Just only need to return error status and leave the _tcp_connect_api handle.
*/
err_t AsyncTCP_detail::tcp_connected(void *arg, tcp_pcb *pcb, err_t err) {
  AsyncClient *c = reinterpret_cast<AsyncClient *>(arg);
  lwip_tcp_event_packet_t *e = (ERR_OK == err && pcb && c) ? new (std::nothrow) lwip_tcp_event_packet_t{LWIP_TCP_CONNECTED, c} : nullptr;
  s8_t slot = (e) ? _register_client_slot(c) : INVALID_CLIENT_SLOT;
  if (INVALID_CLIENT_SLOT == slot) {
    ASYNC_TCP_CONSOLE_E("Connection failed");
    if (e) {
      delete e;
    }
    return ERR_MEM;
  }
  queue_mutex_guard guard;
  c->_pcb = pcb;
  c->_slot = slot; // now slot is valid 
  e->connected.pcb = pcb;
  _bind_tcp_callbacks(pcb, c);
  _prepend_async_event(e);
  return ERR_OK;
}

err_t AsyncTCP_detail::tcp_poll(void *arg, struct tcp_pcb *pcb) {
  // throttle polling events queueing when event queue is getting filled up, let it handle _onack's
  {
    queue_mutex_guard guard;
    if (_async_queue.size() > (rand() % CONFIG_ASYNC_TCP_QUEUE_SIZE / 4 + CONFIG_ASYNC_TCP_QUEUE_SIZE * 3 / 4)) {
      ASYNC_TCP_CONSOLE_E("throttling");
      return ERR_OK;
    }
  }

  AsyncClient *c = reinterpret_cast<AsyncClient *>(arg);
  bool slot = _is_client_slot_valid(c);
  lwip_tcp_event_packet_t *e = (slot && c->_pcb == pcb) ? new (std::nothrow) lwip_tcp_event_packet_t{LWIP_TCP_POLL, c} : nullptr;
  if (!e) {
    ASYNC_TCP_CONSOLE_E("Failed to allocate event packet");
    if (slot) {
      c->_lwip_abort(pcb);
      c->_error(ERR_MEM);
    } else {
      tcp_abort(pcb);
    }
    return ERR_ABRT;  // Tell lwIP we're killing it immediately
  }
  e->poll.pcb = pcb;

  queue_mutex_guard guard;
  _send_async_event(e);
  return ERR_OK;
}

/**
 * _lwip_close --> _fin --> _disconnect() --> ~AsyncClient()
 * _lwip_abort --> _error --> _disconnect() --> ~AsyncClient()
*/
err_t AsyncTCP_detail::tcp_recv(void *arg, struct tcp_pcb *pcb, struct pbuf *pb, err_t err) {
  AsyncClient *c = reinterpret_cast<AsyncClient *>(arg);
  bool slot = _is_client_slot_valid(c);
  lwip_tcp_event_packet_t *e = (slot && c->_pcb == pcb) ? new (std::nothrow) lwip_tcp_event_packet_t{LWIP_TCP_RECV, c} : nullptr;
  if (!e) {
    ASYNC_TCP_CONSOLE_E("Failed to allocate event packet");
    if (pb) {
      if (err == ERR_OK) tcp_recved(pcb, pb->tot_len);
      pbuf_free(pb);
    }
    if (slot) {
      c->_lwip_abort(pcb);
      c->_error(ERR_MEM);
    } else {
      tcp_abort(pcb);
    }
    return ERR_ABRT;  // Tell lwIP we're killing it immediately
  }

  e->recv.pcb = pcb;
  e->recv.err = err;
  e->recv.pb = pb;

