TienHuyIoT/ESP32Async-AsyncTCP/src/AsyncTCP.cpp
static esp_err_t _tcp_abort(tcp_pcb *pcb, s8_t client_slot, tcp_abort_callback cb, void *arg) {
  tcp_api_call_t msg;
  msg.pcb = pcb;
  msg.client_slot = client_slot;
  msg.abort.cb = cb;
  msg.abort.arg = arg;
  tcpip_api_call(_tcp_close_api, (struct tcpip_api_call_data *)&msg);
  return msg.err;
}

static err_t _lwip_callback_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = ERR_OK;
  if (msg->callback.cb) {
    msg->err = msg->callback.cb(msg->callback.arg);
  }
  return msg->err;
}

static esp_err_t _lwip_callback(tcp_callback cb, void *arg) {
  tcp_api_call_t msg;
  msg.callback.cb = cb;
  msg.callback.arg = arg;
  tcpip_api_call(_lwip_callback_api, (struct tcpip_api_call_data *)&msg);
  return msg.err;
}

static err_t _tcp_connect_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  tcp_arg(msg->pcb, msg->connect.arg);
  msg->err = tcp_connect(msg->pcb, msg->connect.addr, msg->connect.port, msg->connect.cb);
  if (msg->err != ERR_OK) {
    ASYNC_TCP_CONSOLE_E("Error %d", msg->err);
    tcp_abort(msg->pcb);
    msg->err = ERR_ABRT;

  }
  return msg->err;
}

static esp_err_t _tcp_connect(tcp_pcb *pcb, s8_t client_slot, ip_addr_t *addr, uint16_t port, tcp_connected_fn cb, void *arg) {
  if (!pcb) {
    return ESP_FAIL;
  }
  tcp_api_call_t msg;
  msg.pcb = pcb;
  msg.connect.addr = addr;
  msg.connect.port = port;
  msg.connect.cb = cb;
  msg.connect.arg = arg;
  tcpip_api_call(_tcp_connect_api, (struct tcpip_api_call_data *)&msg);
  return msg.err;
}

static err_t _dns_gethostbyname_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = dns_gethostbyname(msg->dns_found.name, msg->dns_found.addr, msg->dns_found.cb, msg->dns_found.arg);
  return msg->err;
}

static esp_err_t _dns_gethostbyname(const char *hostname, ip_addr_t *addr, dns_found_callback found, void *arg) {
  tcp_api_call_t msg;
  msg.dns_found.name = hostname;
  msg.dns_found.addr = addr;
  msg.dns_found.cb = found;
  msg.dns_found.arg = arg;
  tcpip_api_call(_dns_gethostbyname_api, (struct tcpip_api_call_data *)&msg);
  return msg.err;
}

static err_t _tcp_new_ip_type_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = ERR_OK;
  msg->pcb = tcp_new_ip_type(msg->new_ip.type);
  return msg->err;
}

static tcp_pcb *_tcp_new_ip_type(u8_t type) {
  tcp_api_call_t msg;
  msg.new_ip.type = type;
  tcpip_api_call(_tcp_new_ip_type_api, (struct tcpip_api_call_data *)&msg);
  return msg.pcb;
}

/*
  Async TCP Client
 */

err_t asynctcp_callback(asynctcp_callback_fn function, void *ctx) {
  lwip_tcp_event_packet_t *e = new (std::nothrow) lwip_tcp_event_packet_t{LWIP_TCP_CALLBACK, nullptr};
  if (!e) {
    ASYNC_TCP_CONSOLE_E("Failed to allocate event packet");
    return ERR_MEM;
  }
  e->callback.fn = function;
  e->callback.arg = ctx;

  queue_mutex_guard guard;
  _send_async_event(e);
  return ERR_OK;
}

u8_t AsyncClient::_client_count = 0;
AsyncClient::AsyncClient(tcp_pcb *pcb, AsyncServer *server)
  : _pcb(pcb), _server(server), _connect_cb(0), _connect_cb_arg(0), _discard_cb(0), _discard_cb_arg(0), _sent_cb(0), _sent_cb_arg(0), _error_cb(0),
    _error_cb_arg(0), _recv_cb(0), _recv_cb_arg(0), _pb_cb(0), _pb_cb_arg(0), _timeout_cb(0), _timeout_cb_arg(0), _poll_cb(0), _poll_cb_arg(0), _ack_pcb(true),
    _tx_last_packet(0), _rx_timeout(0), _rx_last_ack(0), _rx_ack_len(0), _ack_timeout(CONFIG_ASYNC_TCP_MAX_ACK_TIME), _connect_port(0) {
      _id_disconnect = INVALID_CLIENT_EVENT_ID;
      _slot = INVALID_CLIENT_SLOT;
      _client_count++;
      ASYNC_TCP_CONSOLE_I("New client %u, server %u, _client_count = %u", this, _server, _client_count);
      if (_pcb) {
        _rx_last_packet = millis();
      }
    }

AsyncClient::~AsyncClient() {
  _client_count--;
  ASYNC_TCP_CONSOLE_I("Delete client %u, _client_count = %u", this, _client_count);
  _server = nullptr;
  resetCallback();  // avoid any recursive callback
  if (_is_pcb_slot_valid(_slot, _pcb)) {
    ASYNC_TCP_CONSOLE_I("client %u call _close()", this);
    _close(); // client is closed directly in lwIP thread
    _remove_events_for_client(this);
  }
}

/*
 * Operators
 * */

bool AsyncClient::operator==(const AsyncClient &other) const {
  return _pcb == other._pcb;
}

/*
 * Callback Setters
 * */
void AsyncClient::onConnect(AcConnectHandler cb, void *arg) {
  _connect_cb = cb;
  _connect_cb_arg = arg;
}

void AsyncClient::onDisconnect(AcConnectHandler cb, void *arg) {
  _discard_cb = cb;
  _discard_cb_arg = arg;
}

void AsyncClient::onAck(AcAckHandler cb, void *arg) {
  _sent_cb = cb;
  _sent_cb_arg = arg;
}

void AsyncClient::onError(AcErrorHandler cb, void *arg) {
  _error_cb = cb;
  _error_cb_arg = arg;
}

void AsyncClient::onData(AcDataHandler cb, void *arg) {
  _recv_cb = cb;
  _recv_cb_arg = arg;
}

void AsyncClient::onPacket(AcPacketHandler cb, void *arg) {
  _pb_cb = cb;
  _pb_cb_arg = arg;
}

void AsyncClient::onTimeout(AcTimeoutHandler cb, void *arg) {
  _timeout_cb = cb;
  _timeout_cb_arg = arg;
}

void AsyncClient::onPoll(AcConnectHandler cb, void *arg) {
  _poll_cb = cb;
  _poll_cb_arg = arg;
}

/*
 * Main Public Methods
 * */

bool AsyncClient::connect(ip_addr_t addr, uint16_t port) {
  if (_pcb) {
    ASYNC_TCP_CONSOLE_I("already connected, state %d", _pcb->state);
    return false;
  }
  if (!_start_async_task()) {
    ASYNC_TCP_CONSOLE_E("failed to start task");
    return false;
  }

  ASYNC_TCP_CONSOLE_I("Client %u Ip = %s port: %u", this, ipaddr_ntoa(&addr), port);

  if (_client_slot_available() == INVALID_CLIENT_SLOT) {
    ASYNC_TCP_CONSOLE_E("client slot full");
    return false;
  }
  
  tcp_pcb *pcb;
#if LWIP_IPV4 && LWIP_IPV6
  pcb = _tcp_new_ip_type(addr.type);
#else
  pcb = _tcp_new_ip_type(IPADDR_TYPE_V4);
#endif
  if (!pcb) {
    ASYNC_TCP_CONSOLE_E("pcb == NULL");
    return false;
  }

  esp_err_t err = _tcp_connect(pcb, _slot, &addr, port, AsyncTCP_detail::tcp_connected, this);
  bool result = (err == ESP_OK);
  if (!result) {
    ASYNC_TCP_CONSOLE_E("tcp_connect failed: %d", err);
  }
  return result;
}

#ifdef ARDUINO
bool AsyncClient::connect(const IPAddress &ip, uint16_t port) {
  ip_addr_t addr;
#if ESP_IDF_VERSION_MAJOR < 5
#if LWIP_IPV4 && LWIP_IPV6
  // if both IPv4 and IPv6 are enabled, ip_addr_t has a union field and the address type
  addr.u_addr.ip4.addr = ip;
  addr.type = IPADDR_TYPE_V4;
#else
  addr.addr = ip;
#endif
#else
  ip.to_ip_addr_t(&addr);
#endif
  ASYNC_TCP_CONSOLE_I("%u IP %s, port: %u", this, ip.toString().c_str(), port);
  return connect(addr, port);
}
#endif

#if LWIP_IPV6 && ESP_IDF_VERSION_MAJOR < 5
bool AsyncClient::connect(const IPv6Address &ip, uint16_t port) {
  auto ipaddr = static_cast<const uint32_t *>(ip);
  ip_addr_t addr = IPADDR6_INIT(ipaddr[0], ipaddr[1], ipaddr[2], ipaddr[3]);

  return connect(addr, port);
}
#endif

