TienHuyIoT/ESP32Async-AsyncTCP/src/AsyncTCP.cpp
bool AsyncClient::disconnecting() const {
  if (!_pcb) {
    return false;
  }
  return _pcb->state > ESTABLISHED && _pcb->state < TIME_WAIT;
}

bool AsyncClient::disconnected() const {
  if (!_pcb) {
    return true;
  }
  return _pcb->state == CLOSED || _pcb->state == TIME_WAIT;
}

bool AsyncClient::freeable() const {
  if (!_pcb) {
    return true;
  }
  return _pcb->state == CLOSED || _pcb->state > ESTABLISHED;
}

bool AsyncClient::canSend() {
  return space() > 0;
}

const char *AsyncClient::errorToString(err_t error) {
  switch (error) {
    case ERR_OK:         return "OK";
    case ERR_MEM:        return "Out of memory error";
    case ERR_BUF:        return "Buffer error";
    case ERR_TIMEOUT:    return "Timeout";
    case ERR_RTE:        return "Routing problem";
    case ERR_INPROGRESS: return "Operation in progress";
    case ERR_VAL:        return "Illegal value";
    case ERR_WOULDBLOCK: return "Operation would block";
    case ERR_USE:        return "Address in use";
    case ERR_ALREADY:    return "Already connected";
    case ERR_CONN:       return "Not connected";
    case ERR_IF:         return "Low-level netif error";
    case ERR_ABRT:       return "Connection aborted";
    case ERR_RST:        return "Connection reset";
    case ERR_CLSD:       return "Connection closed";
    case ERR_ARG:        return "Illegal argument";
    case -55:            return "DNS failed";
    default:             return "UNKNOWN";
  }
}

const char *AsyncClient::stateToString() const {
  switch (state()) {
    case 0:  return "Closed";
    case 1:  return "Listen";
    case 2:  return "SYN Sent";
    case 3:  return "SYN Received";
    case 4:  return "Established";
    case 5:  return "FIN Wait 1";
    case 6:  return "FIN Wait 2";
    case 7:  return "Close Wait";
    case 8:  return "Closing";
    case 9:  return "Last ACK";
    case 10: return "Time Wait";
    default: return "UNKNOWN";
  }
}

/*
  Async TCP Server
 */
AsyncServer::AsyncServer(ip_addr_t addr, uint16_t port)
  : _port(port), _addr(addr), _noDelay(false), _listen_pcb(nullptr), _listen_connect_cb(nullptr), _connect_cb_arg(nullptr), _disconnect_events(nullptr) {}

#ifdef ARDUINO
AsyncServer::AsyncServer(IPAddress addr, uint16_t port) : _port(port), _noDelay(false), _listen_pcb(nullptr), _listen_connect_cb(nullptr), _connect_cb_arg(nullptr), _disconnect_events(nullptr) {
#if ESP_IDF_VERSION_MAJOR < 5
#if LWIP_IPV4 && LWIP_IPV6
  _addr.type = IPADDR_TYPE_V4;
  _addr.u_addr.ip4.addr = addr;
#else
  _addr.addr = addr;
#endif
#else
  addr.to_ip_addr_t(&_addr);
#endif
}
#if ESP_IDF_VERSION_MAJOR < 5 && __has_include(<IPv6Address.h>) && LWIP_IPV6
AsyncServer::AsyncServer(IPv6Address addr, uint16_t port) : _port(port), _noDelay(false), _listen_pcb(nullptr), _listen_connect_cb(nullptr), _connect_cb_arg(nullptr), _disconnect_events(nullptr) {
#if LWIP_IPV4 && LWIP_IPV6
  _addr.type = IPADDR_TYPE_V6;
#endif
  auto ipaddr = static_cast<const uint32_t *>(addr);
  _addr = IPADDR6_INIT(ipaddr[0], ipaddr[1], ipaddr[2], ipaddr[3]);
}
#endif
#endif

AsyncServer::AsyncServer(uint16_t port) : _port(port), _noDelay(false), _listen_pcb(nullptr), _listen_connect_cb(nullptr), _connect_cb_arg(nullptr), _disconnect_events(nullptr) {
#if LWIP_IPV4 && LWIP_IPV6
  _addr.type = IPADDR_TYPE_ANY;
  _addr.u_addr.ip4.addr = INADDR_ANY;
#else
  _addr.addr = INADDR_ANY;
#endif
}

AsyncServer::~AsyncServer() {
  end();
  if (_disconnect_events) {
    vEventGroupDelete(_disconnect_events);
    _disconnect_events = nullptr;
  }
}

void AsyncServer::onClient(AcConnectHandler cb, void *arg) {
  _listen_connect_cb = cb;
  _connect_cb_arg = arg;
}

bool AsyncServer::begin() {
  if (_listen_pcb) {
    return true;
  }

  if (!_start_async_task()) {
    ASYNC_TCP_CONSOLE_E("failed to start task");
    return false;
  }

  // Safely to run in the LwIP thread
  err_t err = _lwip_callback([](void *arg)->err_t {
    AsyncServer *server = (AsyncServer *)arg;
    err_t err;
#if LWIP_IPV4 && LWIP_IPV6
    server->_listen_pcb = tcp_new_ip_type(server->_addr.type);
#else
    _pcb = _tcp_new_ip_type(IPADDR_TYPE_ANY);
#endif
    if (!server->_listen_pcb) {
      ASYNC_TCP_CONSOLE_E("_pcb == NULL");
      return ERR_VAL;
    }

    err = tcp_bind(server->_listen_pcb, &server->_addr, server->_port);

    if (err != ERR_OK) {
      ASYNC_TCP_CONSOLE_E("bind error: %d", err);
      tcp_abort(server->_listen_pcb); // forcibly free unbound PCB
      server->_listen_pcb = NULL;
      return ERR_ABRT;
    }

    constexpr uint8_t backlog = CONFIG_LWIP_MAX_ACTIVE_TCP / 2; // up to you
    server->_listen_pcb = tcp_listen_with_backlog(server->_listen_pcb, backlog);
    if (!server->_listen_pcb) {
      ASYNC_TCP_CONSOLE_E("listen_pcb == NULL");
      return ERR_VAL;
    }
    tcp_arg(server->_listen_pcb, (void *)server);
    tcp_accept(server->_listen_pcb, &AsyncTCP_detail::tcp_accept);
    return ERR_OK;
  }, this);

  if (err != ERR_OK) {
    ASYNC_TCP_CONSOLE_E("Server %u Init Failed", this);
  } else {
    ASYNC_TCP_CONSOLE_I("Server %u Init succeed", this);
  }
  return (err == ERR_OK);
}

void AsyncServer::end() {
  ASYNC_TCP_CONSOLE_I("Server %u End", this);
  _lwip_callback([](void *arg)->err_t {
    AsyncServer *s = (AsyncServer *)arg;
    s->_lwip_end();
    return ERR_OK;
  }, this);

  if (_wait_events) {
    EventBits_t bits = xEventGroupWaitBits(
      _disconnect_events, _wait_events,
      pdFALSE, // unclear bits on exit
      pdTRUE,  // all bits
      pdMS_TO_TICKS(5000) // wait for 1s
    );
    ASYNC_TCP_CONSOLE_I("Server %u closed all clients, bits = %08X", this, bits);
  }
}

// Must be called In LwIP Thread
void AsyncServer::_lwip_end() {
  if (_listen_pcb) {
    tcp_arg(_listen_pcb, NULL);
    tcp_accept(_listen_pcb, NULL);
    if (tcp_close(_listen_pcb) != ERR_OK) {
      tcp_abort(_listen_pcb);
    }
    _listen_pcb = NULL;
  }

  if (!_disconnect_events) {
    _disconnect_events = xEventGroupCreate();
  }
  _wait_events = 0;
  for (u8_t i = 0; i < CONFIG_LWIP_MAX_ACTIVE_TCP; ++i) {
    AsyncClient *c = _clients[i];
    if (c && c->_pcb && (c->_server == this)) {
      c->_id_disconnect = i;
      ASYNC_TCP_CONSOLE_I("Client %u disconnect id = %d", c, c->_id_disconnect);
      bitSet(_wait_events, i);
      xEventGroupClearBits(_disconnect_events, 1U << i);
      err_t err = c->_lwip_close(c->_pcb); // close immediately in LwIP thread
      lwip_tcp_event_packet_t *e = new (std::nothrow) lwip_tcp_event_packet_t{LWIP_TCP_FIN, c};
      if (!e) {
        ASYNC_TCP_CONSOLE_E("Failed to allocate event packet");
        c->_error(ERR_MEM);
        continue;
      }
      e->sent.pcb = c->_pcb;
      e->recv.err = err;

      queue_mutex_guard guard;
      if (err == ERR_ABRT) {
        _prepend_async_event(e);
      } else {
        _send_async_event(e);
      }
    }
  }
}

err_t AsyncServer::_accepted(AsyncClient *client) {
  if (_listen_connect_cb) {
    _listen_connect_cb(_connect_cb_arg, client);
  }
  return ERR_OK;
}

void AsyncServer::_handleDisconnect(AsyncClient *client) {
  if (client) {
    if (client->_id_disconnect != INVALID_CLIENT_EVENT_ID) {
      ASYNC_TCP_CONSOLE_I("Server %u handle disconnect for client %u id = %u", this, client, client->_id_disconnect);
      xEventGroupSetBits(_disconnect_events, 1U << client->_id_disconnect);
    }
    delete client;
  }
}

void AsyncServer::setNoDelay(bool nodelay) {
  _noDelay = nodelay;
}

bool AsyncServer::getNoDelay() const {
  return _noDelay;
}

uint8_t AsyncServer::status() const {
  if (!_listen_pcb) {
    return 0;
  }
  return _listen_pcb->state;
}
